#
# US English Error messages for JDBC
#
# Note:
# - Error codes are defined in DatabaseError.java.
#
# Message Guidelines:
# (The existing messages are not consistent, but do follow this guideline
# when you are creating new ones, or changing old ones.)
#
# - Messages start in lower-cases (eg. "invalid data type").
# - Do not put signs in message.  This is bad: "-> NULL".
# - Use past tense (eg. "failed to convert data").
#

#
# Add all error messages above here
#
# Below are MBean descriptions. They do not follow the message guidelines.
# Description of oracle.jdbc.driver.OracleDiagnosabilityMBean operations.

DiagnosabilityMBeanDescription=Ur\u010Duje funkce prov\u00E1d\u011Bn\u00ED diagnostiky ovlada\u010D\u016F aplikace Oracle JDBC.

DiagnosabilityMBeanConstructor()=Konstruktor komponenty MBean pro prov\u00E1d\u011Bn\u00ED diagnostiky aplikace Oracle JDBC s nulov\u00FDm po\u010Dtem argument\u016F

DiagnosabilityMBeanLoggingEnabledDescription=Ve\u0161ker\u00FD k\u00F3d protokolov\u00E1n\u00ED aplikace Oracle JDBC se \u0159\u00EDd\u00ED t\u00EDmto booleovsk\u00FDm atributem. Pokud m\u00E1 hodnotu false, nebudou vytvo\u0159eny \u017E\u00E1dn\u00E9 zpr\u00E1vy protokolu, pokud m\u00E1 hodnotu true, budou zpr\u00E1vy protokolu \u0159\u00EDzeny \u00FArovn\u011Bmi a filtry java.util.logging.

DiagnosabilityMBeanStateManageableDescription=Ovlada\u010De aplikace Oracle JDBC nelze spustit a zastavit. V\u017Edy bude vr\u00E1cena hodnota false.

DiagnosabilityMBeanStatisticsProviderDescription=Ovlada\u010De Oracle JDBC neposkytuj\u00ED statistiku prost\u0159ednictv\u00EDm komponenty MBean pro prov\u00E1d\u011Bn\u00ED diagnostiky.

DiagnosabilityMBeanTraceControllerDescription=Clio - ovlada\u010D trasov\u00E1n\u00ED.

DiagnosabilityMBeanSuspendDescription=Clio - operace pozastaven\u00ED.

DiagnosabilityMBeanResumeDescription=Clio - operace pokra\u010Dov\u00E1n\u00ED.

DiagnosabilityMBeanTraceDescription=Clio - operace trasov\u00E1n\u00ED.

DiagnosabilityMBeanEnableContinousLoggingDescription=Aktivuje zabezpe\u010Den\u00E9 souvisl\u00E9 protokolov\u00E1n\u00ED soubor\u016F. Filtry ServiceName a UserName se daj\u00ED pou\u017E\u00EDt, jsou-li nastaveny. Ve v\u00FDchoz\u00EDm nastaven\u00ED je deaktivov\u00E1no.

DiagnosabilityMBeanDisableContinousLoggingDescription=Deaktivuje zabezpe\u010Den\u00E9 souvisl\u00E9 protokolov\u00E1n\u00ED soubor\u016F. Ve v\u00FDchoz\u00EDm nastaven\u00ED je deaktivov\u00E1no.

DiagnosabilityMBeanEnableInMemoryLoggingDescription=Aktivuje zabezpe\u010Den\u00E9 trasov\u00E1n\u00ED v pam\u011Bti. Filtry ServiceName a UserName se daj\u00ED pou\u017E\u00EDt, jsou-li nastaveny. Ve v\u00FDchoz\u00EDm nastaven\u00ED je aktivov\u00E1no.

DiagnosabilityMBeanDisableInMemoryLoggingDescription=Deaktivuje zabezpe\u010Den\u00E9 trasov\u00E1n\u00ED v pam\u011Bti. Ve v\u00FDchoz\u00EDm nastaven\u00ED je aktivov\u00E1no.

DiagnosabilityMBeanServiceNameFilterDescription=Jestli\u017Ee je nastaven filtr ServiceName, je trasov\u00E1n\u00ED v pam\u011Bti / souvisl\u00E9 protokolov\u00E1n\u00ED aktivov\u00E1no jen u p\u0159ipojen\u00ED konfigurovan\u00E9 slu\u017Eby.

DiagnosabilityMBeanUserFilterDescription=Jestli\u017Ee je nastaven filtr UserName, je trasov\u00E1n\u00ED v pam\u011Bti / souvisl\u00E9 protokolov\u00E1n\u00ED aktivov\u00E1no jen u p\u0159ipojen\u00ED konfigurovan\u00E9 slu\u017Eby.

ReplayStatisticsMBeanDescription=Zp\u0159\u00EDstupn\u00ED statistiku funkce Kontinuita aplikace (AC).

ReplayStatisticsMBeanConstructor=Konstruktor komponenty MBean pro prov\u00E1d\u011Bn\u00ED statistiky AC aplikace Oracle JDBC s nulov\u00FDm po\u010Dtem argument\u016F

ReplayStatisticsMBeanAllStatisticsDescription=Z\u00EDsk\u00E1 statistiku AC ze v\u0161ech zn\u00E1m\u00FDch instanc\u00ED datov\u00E9ho zdroje ovlada\u010De.

ReplayStatisticsMBeanGetDSStatisticsDescription=Z\u00EDsk\u00E1 statistiku AC pro konkr\u00E9tn\u00ED instanci datov\u00E9ho zdroje ovlada\u010De.

# Description of oracle.jdbc.diagnostics.OracleDiagnosticsMXBean operations.

DiagnosticsMBeanDescription=Ur\u010Duje funkce prov\u00E1d\u011Bn\u00ED diagnostiky ovlada\u010D\u016F aplikace Oracle JDBC.

DiagnosticsMBeanLoggingEnabledAttributeDescription=Ve\u0161ker\u00FD k\u00F3d protokolov\u00E1n\u00ED aplikace Oracle JDBC se \u0159\u00EDd\u00ED t\u00EDmto booleovsk\u00FDm atributem. V\u00FDchoz\u00ED hodnota je false. Pokud je tato funkce zapnut\u00E1, budou zpr\u00E1vy protokolu \u0159\u00EDzeny \u00FArovn\u011Bmi a filtry java.util.logging. Pokud je vypnut\u00E1, nebudou se vytv\u00E1\u0159et \u017E\u00E1dn\u00E9 zpr\u00E1vy protokolu.

DiagnosticsMBeanWriteLogsToTraceAttributeDescription=Vrac\u00ED hodnotu true, pokud je povolen z\u00E1pis protokol\u016F do vyrovn\u00E1vac\u00ED pam\u011Bti trasov\u00E1n\u00ED v pam\u011Bti. V\u00FDchoz\u00ED hodnota je false.

DiagnosticsMBeanEnableTracingByConnectionIdPrefixOperationDescription=Trasov\u00E1n\u00ED je ve v\u00FDchoz\u00EDm nastaven\u00ED zapnuto. Tato operace aktivuje trasov\u00E1n\u00ED podle dan\u00E9 p\u0159edpony ID p\u0159ipojen\u00ED, pokud bylo deaktivov\u00E1no.

DiagnosticsMBeanDisableTracingByConnectionIdPrefixOperationDescription=Trasov\u00E1n\u00ED je ve v\u00FDchoz\u00EDm nastaven\u00ED zapnuto. Tato operace deaktivuje trasov\u00E1n\u00ED podle dan\u00E9 p\u0159edpony ID p\u0159ipojen\u00ED.

DiagnosticsMBeanEnableTracingByTenantNameOperationDescription=Trasov\u00E1n\u00ED je ve v\u00FDchoz\u00EDm nastaven\u00ED zapnuto. Tato operace aktivuje trasov\u00E1n\u00ED podle dan\u00E9ho jm\u00E9na klientu, pokud bylo deaktivov\u00E1no.

DiagnosticsMBeanDisableTracingByTenantNameOperationDescription=Trasov\u00E1n\u00ED je ve v\u00FDchoz\u00EDm nastaven\u00ED zapnuto. Tato operace deaktivuje trasov\u00E1n\u00ED podle dan\u00E9ho jm\u00E9na klientu.

DiagnosticsMBeanEnableTracingByLoggerNameOperationDescription=Trasov\u00E1n\u00ED je ve v\u00FDchoz\u00EDm nastaven\u00ED zapnuto. Tato operace aktivuje trasov\u00E1n\u00ED podle dan\u00E9ho n\u00E1zvu slu\u017Eby protokolov\u00E1n\u00ED logger, pokud byla deaktivov\u00E1na.

DiagnosticsMBeanDisableTracingByLoggerNameOperationDescription=Trasov\u00E1n\u00ED je ve v\u00FDchoz\u00EDm nastaven\u00ED zapnuto. Tato operace deaktivuje trasov\u00E1n\u00ED podle dan\u00E9ho n\u00E1zvu slu\u017Eby protokolov\u00E1n\u00ED logger.

DiagnosticsMBeanEnableTracingOperationDescription=Trasov\u00E1n\u00ED je ve v\u00FDchoz\u00EDm nastaven\u00ED zapnuto. Tato operace aktivuje trasov\u00E1n\u00ED, pokud bylo deaktivov\u00E1no.

DiagnosticsMBeanDisableTracingOperationDescription=Trasov\u00E1n\u00ED je ve v\u00FDchoz\u00EDm nastaven\u00ED zapnuto. Tato operace deaktivuje trasov\u00E1n\u00ED.

DiagnosticsEnableLoggingByConnectionIdPrefixOperationDescription=Protokolov\u00E1n\u00ED je ve v\u00FDchoz\u00EDm nastaven\u00ED vypnuto. Tato operace aktivuje protokolov\u00E1n\u00ED podle dan\u00E9 p\u0159edpony ID p\u0159ipojen\u00ED.

DiagnosticsDisableLoggingByConnectionIdPrefixOperationDescription=Protokolov\u00E1n\u00ED je ve v\u00FDchoz\u00EDm nastaven\u00ED vypnuto. Tato operace deaktivuje protokolov\u00E1n\u00ED podle dan\u00E9 p\u0159edpony ID p\u0159ipojen\u00ED, pokud bylo aktivov\u00E1no.

DiagnosticsEnableLoggingByTenantNameOperationDescription=Protokolov\u00E1n\u00ED je ve v\u00FDchoz\u00EDm nastaven\u00ED vypnuto. Tato operace aktivuje protokolov\u00E1n\u00ED podle dan\u00E9ho jm\u00E9na klientu.

DiagnosticsDisableLoggingByTenantNameOperationDescription=Protokolov\u00E1n\u00ED je ve v\u00FDchoz\u00EDm nastaven\u00ED vypnuto. Tato operace deaktivuje protokolov\u00E1n\u00ED podle dan\u00E9ho n\u00E1zvu klientu, pokud bylo aktivov\u00E1no.

DiagnosticsEnableLoggingByLoggerNameOperationDescription=Protokolov\u00E1n\u00ED je ve v\u00FDchoz\u00EDm nastaven\u00ED vypnuto. Tato operace aktivuje protokolov\u00E1n\u00ED podle dan\u00E9ho n\u00E1zvu slu\u017Eby protokolov\u00E1n\u00ED logger.

DiagnosticsDisableLoggingByLoggerNameOperationDescription=Protokolov\u00E1n\u00ED je ve v\u00FDchoz\u00EDm nastaven\u00ED vypnuto. Tato operace deaktivuje protokolov\u00E1n\u00ED podle dan\u00E9ho n\u00E1zvu slu\u017Eby protokolov\u00E1n\u00ED logger, pokud byla aktivov\u00E1na.

DiagnosticsEnableLoggingOperationDescription=Protokolov\u00E1n\u00ED je ve v\u00FDchoz\u00EDm nastaven\u00ED vypnuto. Tato operace aktivuje protokolov\u00E1n\u00ED.

DiagnosticsDisableLoggingOperationDescription=Protokolov\u00E1n\u00ED je ve v\u00FDchoz\u00EDm nastaven\u00ED vypnuto. Tato operace deaktivuje protokolov\u00E1n\u00ED, pokud bylo aktivov\u00E1no.

DiagnosticsEnableSensitiveDiagnosticsByConnectionIdPrefixOperationDescription=Diagnostika citliv\u00FDch dat je ve v\u00FDchoz\u00EDm nastaven\u00ED vypnuta. Tato operace aktivuje diagnostiku citliv\u00FDch dat podle dan\u00E9 p\u0159edpony ID p\u0159ipojen\u00ED.

DiagnosticsDisableSensitiveDiagnosticsByConnectionIdPrefixOperationDescription=Diagnostika citliv\u00FDch dat je ve v\u00FDchoz\u00EDm nastaven\u00ED vypnuta. Tato operace deaktivuje diagnostiku citliv\u00FDch dat podle dan\u00E9 p\u0159edpony ID p\u0159ipojen\u00ED, pokud byla aktivov\u00E1na.

DiagnosticsEnableSensitiveDiagnosticsByTenantNameOperationDescription=Diagnostika citliv\u00FDch dat je ve v\u00FDchoz\u00EDm nastaven\u00ED vypnuta. Tato operace aktivuje diagnostiku citliv\u00FDch dat podle dan\u00E9ho jm\u00E9na klientu.

DiagnosticsDisableSensitiveDiagnosticsByTenantNameOperationDescription=Diagnostika citliv\u00FDch dat je ve v\u00FDchoz\u00EDm nastaven\u00ED vypnuta. Tato operace deaktivuje diagnostiku citliv\u00FDch dat podle dan\u00E9ho jm\u00E9na klientu, pokud byla aktivov\u00E1na.

DiagnosticsEnableSensitiveDiagnosticsByLoggerNameOperationDescription=Diagnostika citliv\u00FDch dat je ve v\u00FDchoz\u00EDm nastaven\u00ED vypnuta. Tato operace aktivuje diagnostiku citliv\u00FDch dat podle dan\u00E9ho n\u00E1zvu slu\u017Eby protokolov\u00E1n\u00ED logger.

DiagnosticsDisableSensitiveDiagnosticsByLoggerNameOperationDescription=Diagnostika citliv\u00FDch dat je ve v\u00FDchoz\u00EDm nastaven\u00ED vypnuta. Tato operace deaktivuje diagnostiku citliv\u00FDch dat podle dan\u00E9ho n\u00E1zvu slu\u017Eby protokolov\u00E1n\u00ED logger, pokud byla aktivov\u00E1na.

DiagnosticsEnableSensitiveDiagnosticsOperationDescription=Diagnostika citliv\u00FDch dat je ve v\u00FDchoz\u00EDm nastaven\u00ED vypnuta. Tato operace aktivuje diagnostiku citliv\u00FDch dat.

DiagnosticsDisableSensitiveDiagnosticsOperationDescription=Diagnostika citliv\u00FDch dat je ve v\u00FDchoz\u00EDm nastaven\u00ED vypnuta. Tato operace deaktivuje diagnostiku citliv\u00FDch dat, pokud byla aktivov\u00E1na.

DiagnosticsUpdateDiagnosticLevelByConnectionIdPrefixOperationDescription=Aktualizuje \u00FArove\u0148 diagnostiky podle zadan\u00E9 p\u0159edpony ID p\u0159ipojen\u00ED. \u0158et\u011Bzec argumentu se m\u016F\u017Ee skl\u00E1dat bu\u010F z\u00A0n\u00E1zvu \u00FArovn\u011B, nebo z\u00A0celo\u010D\u00EDseln\u00E9 hodnoty. Nap\u0159\u00EDklad: "SEVERE" nebo "1000".

DiagnosticsUpdateDiagnosticLevelByTenantNameOperationDescription=Aktualizuje \u00FArove\u0148 diagnostiky podle zadan\u00E9ho n\u00E1zvu z\u00E1kazn\u00EDka. \u0158et\u011Bzec argumentu se m\u016F\u017Ee skl\u00E1dat bu\u010F z\u00A0n\u00E1zvu \u00FArovn\u011B, nebo z\u00A0celo\u010D\u00EDseln\u00E9 hodnoty. Nap\u0159\u00EDklad: "SEVERE" nebo "1000".

DiagnosticsUpdateDiagnosticLevelByLoggerNameOperationDescription=Aktualizuje \u00FArove\u0148 diagnostiky podle zadan\u00E9ho n\u00E1zvu protokolovac\u00EDho n\u00E1stroje. \u0158et\u011Bzec argumentu se m\u016F\u017Ee skl\u00E1dat bu\u010F z\u00A0n\u00E1zvu \u00FArovn\u011B, nebo z\u00A0celo\u010D\u00EDseln\u00E9 hodnoty. Nap\u0159\u00EDklad: "SEVERE" nebo "1000".

DiagnosticsUpdateDiagnosticLevelOperationDescription=Aktualizuje \u00FArove\u0148 diagnostiky. \u0158et\u011Bzec argumentu se m\u016F\u017Ee skl\u00E1dat bu\u010F z\u00A0n\u00E1zvu \u00FArovn\u011B, nebo z\u00A0celo\u010D\u00EDseln\u00E9 hodnoty. Nap\u0159\u00EDklad: "SEVERE" nebo "1000".

DiagnosticsUpdateBufferSizeByConnectionIdPrefixOperationDescription=Aktualizuje velikost vyrovn\u00E1vac\u00ED pam\u011Bti trasov\u00E1n\u00ED v\u00A0pam\u011Bti podle dan\u00E9 p\u0159edpony ID p\u0159ipojen\u00ED. V\u00FDchoz\u00ED velikost vyrovn\u00E1vac\u00ED pam\u011Bti je 4000\u00A0z\u00E1znam\u016F protokolu.

DiagnosticsUpdateBufferSizeByTenantNameOperationDescription=Aktualizuje velikost vyrovn\u00E1vac\u00ED pam\u011Bti trasov\u00E1n\u00ED v\u00A0pam\u011Bti podle dan\u00E9ho n\u00E1zvu z\u00E1kazn\u00EDka. V\u00FDchoz\u00ED velikost vyrovn\u00E1vac\u00ED pam\u011Bti je 4000\u00A0z\u00E1znam\u016F protokolu.

DiagnosticsUpdateBufferSizeByLoggerNameOperationDescription=Aktualizuje velikost vyrovn\u00E1vac\u00ED pam\u011Bti trasov\u00E1n\u00ED v\u00A0pam\u011Bti podle dan\u00E9ho n\u00E1zvu protokolovac\u00EDho n\u00E1stroje. V\u00FDchoz\u00ED velikost vyrovn\u00E1vac\u00ED pam\u011Bti je 4000\u00A0z\u00E1znam\u016F protokolu.

DiagnosticsUpdateBufferSizeOperationDescription=Aktualizuje velikost vyrovn\u00E1vac\u00ED pam\u011Bti trasov\u00E1n\u00ED v\u00A0pam\u011Bti. V\u00FDchoz\u00ED velikost vyrovn\u00E1vac\u00ED pam\u011Bti je 4000\u00A0z\u00E1znam\u016F protokolu.

DiagnosticsReadLoggingConfigFileOperationDescription=Znovu inicializujte vlastnosti protokolov\u00E1n\u00ED a znovu na\u010Dt\u011Bte konfiguraci protokolov\u00E1n\u00ED z dan\u00E9ho souboru, kter\u00FD by m\u011Bl b\u00FDt ve form\u00E1tu java.util.Properties.

DiagnosticsAddErrorCodeToWatchListOperationDescription=Chybov\u00E9 k\u00F3dy, u\u00A0kter\u00FDch m\u00E1 b\u00FDt sledov\u00E1n p\u0159\u00ED\u0161t\u00ED v\u00FDskyt, zadejte ve form\u00E1tu ORA-XXXXX. Ovlada\u010D JDBC zap\u00ED\u0161e trasov\u00E1n\u00ED v\u00A0pam\u011Bti do konfigurovan\u00E9ho deskriptoru protokolu, kdy\u017E dojde k\u00A0chyb\u011B uveden\u00E9 v\u00A0seznamu sledov\u00E1n\u00ED.

DiagnosticsRemoveErrorCodeFromWatchListOperationDescription=Odstra\u0148te dan\u00FD chybov\u00FD k\u00F3d ze seznamu sledovan\u00FDch. K\u00F3d chyby by m\u011Bl b\u00FDt ve form\u00E1tu ORA-XXXXX.

DiagnosticsReturnErrorCodesWatchListOperationDescription=Na\u010Dt\u011Bte sledovan\u00E9 chybov\u00E9 k\u00F3dy.

DiagnosticsResetErrorCodesWatchListOperationDescription=Konfigurujte seznam sledov\u00E1n\u00ED pomoc\u00ED v\u00FDchoz\u00EDch chybov\u00FDch k\u00F3d\u016F.

DiagnosticsDumpTraceOperationDescription=Vypi\u0161te trasov\u00E1n\u00ED v pam\u011Bti do c\u00EDlov\u00E9ho obslu\u017En\u00E9ho programu.

DiagnosticsDumpTraceWhenFutureExceptionContainsOperationDescription=Pokud budouc\u00ED v\u00FDjimka obsahuje jedno z dan\u00FDch kl\u00ED\u010Dov\u00FDch slov, odstra\u0148te trasov\u00E1n\u00ED. Vzorov\u00E1 kl\u00ED\u010Dov\u00E1 slova jsou reset, violation.

DiagnosticsClearExceptionKeywordsOperationDescription=Vyma\u017Ete d\u0159\u00EDve p\u0159idan\u00E1 kl\u00ED\u010Dov\u00E1 slova.

DiagnosticsEnableWriteLogsToTraceOperationDescription=Ve v\u00FDchoz\u00EDm nastaven\u00ED se protokoly zapisuj\u00ED do obslu\u017En\u00E9ho programu protokol\u016F. Tato operace aktivuje nebo deaktivuje zapisov\u00E1n\u00ED protokol\u016F do trasov\u00E1n\u00ED v pam\u011Bti.

DiagnosticsConnectionIdPrefixParameterDescription=P\u0159edpona ID p\u0159ipojen\u00ED.

DiagnosticsTenantNameParameterDescription=N\u00E1zev klientu.

DiagnosticsLoggerNameParameterDescription=N\u00E1zev slu\u017Eby protokolov\u00E1n\u00ED Logger.

DiagnosticsLevelParameterDescription=\u00DArove\u0148 slu\u017Eby protokolov\u00E1n\u00ED Logger.

DiagnosticsBufferSizeParameterDescription=Velikost vyrovn\u00E1vac\u00ED pam\u011Bti trasov\u00E1n\u00ED v\u00A0pam\u011Bti.

DiagnosticsConfigFileParameterDescription=Soubor konfigurace protokolov\u00E1n\u00ED.

DiagnosticsErrorCodesParameterDescription=K\u00F3d chyby ve form\u00E1tu ORA-XXXXX.

DiagnosticsEnabledParameterDescription=Hodnota true nebo false.

DiagnosticsCommaSeparatedKeywordsParameterDescription=Kl\u00ED\u010Dov\u00E1 slova jako hodnoty odd\u011Blen\u00E9 \u010D\u00E1rkou.

#     ^     ^     ^     ^
#     |     |     |     |        P L E A S E    R E A D
#
# Add new message above this comment.
# Before you add a new message, please read "Message Guideline" at the
# top of this file first.
#






