#
# US English Error messages for JDBC
#
# Note:
# - Error codes are defined in DatabaseError.java.
#
# Message Guidelines:
# (The existing messages are not consistent, but do follow this guideline
# when you are creating new ones, or changing old ones.)
#
# - Messages start in lower-cases (eg. "invalid data type").
# - Do not put signs in message.  This is bad: "-> NULL".
# - Use past tense (eg. "failed to convert data").
#

#
# Add all error messages above here
#
# Below are MBean descriptions. They do not follow the message guidelines.
# Description of oracle.jdbc.driver.OracleDiagnosabilityMBean operations.

DiagnosabilityMBeanDescription=Controla las funciones de diagn\u00F3stico de los controladores JDBC de Oracle.

DiagnosabilityMBeanConstructor()=Constructor de argumento cero para el MBean de diagn\u00F3stico de Oracle JDBC

DiagnosabilityMBeanLoggingEnabledDescription=Este atributo booleano controla todo el c\u00F3digo de registro de Oracle JDBC. Si es false, no se producir\u00E1 ning\u00FAn mensaje de log. Si es true, los niveles y los filtros de java.util.logging controlar\u00E1n los mensajes de log.

DiagnosabilityMBeanStateManageableDescription=Los controladores JDBC de Oracle no se pueden iniciar y parar. Siempre devuelven false.

DiagnosabilityMBeanStatisticsProviderDescription=Los controladores JDBC de Oracle no proporcionan estad\u00EDsticas mediante el MBean de diagn\u00F3stico.

DiagnosabilityMBeanTraceControllerDescription=Controlador de rastreo Clio.

DiagnosabilityMBeanSuspendDescription=Operaci\u00F3n de supensi\u00F3n Clio.

DiagnosabilityMBeanResumeDescription=Operaci\u00F3n de reanudaci\u00F3n Clio.

DiagnosabilityMBeanTraceDescription=Operaci\u00F3n de rastreo Clio.

DiagnosabilityMBeanEnableContinousLoggingDescription=Activa el registro de archivos continuo y seguro. Hay que definir los filtros ServiceName y UserName para aplicarlos. Est\u00E1 desactivado por defecto.

DiagnosabilityMBeanDisableContinousLoggingDescription=Desactiva el registro de archivos continuo y seguro. Est\u00E1 desactivado por defecto.

DiagnosabilityMBeanEnableInMemoryLoggingDescription=Activa el rastreo de memoria seguro. Hay que definir los filtros ServiceName y UserName para aplicarlos. Est\u00E1 activado por defecto.

DiagnosabilityMBeanDisableInMemoryLoggingDescription=Desactiva el rastreo de memoria seguro. Est\u00E1 desactivado por defecto.

DiagnosabilityMBeanServiceNameFilterDescription=Si se define el filtro ServiceName, el registro en memoria/continuo se activa solo para las conexiones del servicio configurado.

DiagnosabilityMBeanUserFilterDescription=Si se define el filtro de usuario, el registro en memoria/continuo se activa solo para las conexiones del usuario configurado.

ReplayStatisticsMBeanDescription=Muestra las estad\u00EDsticas de la funci\u00F3n Continuidad de la aplicaci\u00F3n (AC).

ReplayStatisticsMBeanConstructor=Constructor de argumento cero para el MBean de estad\u00EDstica AC de Oracle JDBC

ReplayStatisticsMBeanAllStatisticsDescription=Obtiene las estad\u00EDsticas de AC en todas las instancias conocidas del origen de datos del controlador.

ReplayStatisticsMBeanGetDSStatisticsDescription=Obtiene las estad\u00EDsticas de AC para una instancia concreta del origen de datos del controlador.

# Description of oracle.jdbc.diagnostics.OracleDiagnosticsMXBean operations.

DiagnosticsMBeanDescription=Controla las funciones de diagn\u00F3stico de los controladores JDBC de Oracle.

DiagnosticsMBeanLoggingEnabledAttributeDescription=Este atributo booleano controla todo el c\u00F3digo de registro de Oracle JDBC. Su valor por defecto es False. Si est\u00E1 activado, los niveles y los filtros de java.util.logging controlar\u00E1n los mensajes de log. Si est\u00E1 desactivado, no se producir\u00E1 ning\u00FAn mensaje de log.

DiagnosticsMBeanWriteLogsToTraceAttributeDescription=Devuelve True si la escritura de logs del buffer de rastreo en memoria est\u00E1 activada. Su valor por defecto es False.

DiagnosticsMBeanEnableTracingByConnectionIdPrefixOperationDescription=El rastreo est\u00E1 activado por defecto. Esta operaci\u00F3n activa el rastreo (si est\u00E1 desactivado) por el prefijo del ID de conexi\u00F3n proporcionado.

DiagnosticsMBeanDisableTracingByConnectionIdPrefixOperationDescription=El rastreo est\u00E1 activado por defecto. Esta operaci\u00F3n desactiva el rastreo por el prefijo del ID de conexi\u00F3n.

DiagnosticsMBeanEnableTracingByTenantNameOperationDescription=El rastreo est\u00E1 activado por defecto. Esta operaci\u00F3n activa el rastreo (si est\u00E1 desactivado) por el nombre de inquilino proporcionado.

DiagnosticsMBeanDisableTracingByTenantNameOperationDescription=El rastreo est\u00E1 activado por defecto. Esta operaci\u00F3n desactiva el rastreo por el nombre de inquilino proporcionado.

DiagnosticsMBeanEnableTracingByLoggerNameOperationDescription=El rastreo est\u00E1 activado por defecto. Esta operaci\u00F3n activa el rastreo (si est\u00E1 desactivado) por el nombre de registrador proporcionado.

DiagnosticsMBeanDisableTracingByLoggerNameOperationDescription=El rastreo est\u00E1 activado por defecto. Esta operaci\u00F3n desactiva el rastreo por el nombre de registrador proporcionado.

DiagnosticsMBeanEnableTracingOperationDescription=El rastreo est\u00E1 activado por defecto. Esta operaci\u00F3n activa el rastreo si est\u00E1 desactivado.

DiagnosticsMBeanDisableTracingOperationDescription=El rastreo est\u00E1 activado por defecto. Esta operaci\u00F3n desactiva el rastreo.

DiagnosticsEnableLoggingByConnectionIdPrefixOperationDescription=El registro est\u00E1 desactivado por defecto. Esta operaci\u00F3n activa el registro mediante el prefijo del ID de conexi\u00F3n proporcionado.

DiagnosticsDisableLoggingByConnectionIdPrefixOperationDescription=El registro est\u00E1 desactivado por defecto. Esta operaci\u00F3n desactiva el registro (si est\u00E1 activado) por el prefijo del ID de conexi\u00F3n proporcionado.

DiagnosticsEnableLoggingByTenantNameOperationDescription=El registro est\u00E1 desactivado por defecto. Esta operaci\u00F3n activa el registro por el nombre de inquilino proporcionado.

DiagnosticsDisableLoggingByTenantNameOperationDescription=El registro est\u00E1 desactivado por defecto. Esta operaci\u00F3n desactiva el registro (si est\u00E1 activado) por el nombre de inquilino.

DiagnosticsEnableLoggingByLoggerNameOperationDescription=El registro est\u00E1 desactivado por defecto. Esta operaci\u00F3n activa el registro por el nombre de registrador proporcionado.

DiagnosticsDisableLoggingByLoggerNameOperationDescription=El registro est\u00E1 desactivado por defecto. Esta operaci\u00F3n desactiva el registro (si est\u00E1 activado) por el nombre de registrador.

DiagnosticsEnableLoggingOperationDescription=El registro est\u00E1 desactivado por defecto. Esta operaci\u00F3n activa el registro.

DiagnosticsDisableLoggingOperationDescription=El registro est\u00E1 desactivado por defecto. Esta operaci\u00F3n desactiva el registro si est\u00E1 activado.

DiagnosticsEnableSensitiveDiagnosticsByConnectionIdPrefixOperationDescription=Los diagn\u00F3sticos con datos confidenciales est\u00E1n desactivados por defecto. Esta operaci\u00F3n activa los diagn\u00F3sticos con datos confidenciales por el prefijo del ID de conexi\u00F3n dada proporcionado.

DiagnosticsDisableSensitiveDiagnosticsByConnectionIdPrefixOperationDescription=Los diagn\u00F3sticos con datos confidenciales est\u00E1n desactivados por defecto. Esta operaci\u00F3n desactiva los diagn\u00F3sticos con datos confidenciales (si est\u00E1n activados) por el prefijo del ID de conexi\u00F3n dada proporcionado.

DiagnosticsEnableSensitiveDiagnosticsByTenantNameOperationDescription=Los diagn\u00F3sticos con datos confidenciales est\u00E1n desactivados por defecto. Esta operaci\u00F3n activa los diagn\u00F3sticos con datos confidenciales por el nombre de inquilino proporcionado.

DiagnosticsDisableSensitiveDiagnosticsByTenantNameOperationDescription=Los diagn\u00F3sticos con datos confidenciales est\u00E1n desactivados por defecto. Esta operaci\u00F3n desactiva los diagn\u00F3sticos con datos confidenciales (si est\u00E1n activados) por el nombre de inquilino proporcionado.

DiagnosticsEnableSensitiveDiagnosticsByLoggerNameOperationDescription=Los diagn\u00F3sticos con datos confidenciales est\u00E1n desactivados por defecto. Esta operaci\u00F3n activa los diagn\u00F3sticos con datos confidenciales por el nombre de registrador proporcionado.

DiagnosticsDisableSensitiveDiagnosticsByLoggerNameOperationDescription=Los diagn\u00F3sticos con datos confidenciales est\u00E1n desactivados por defecto. Esta operaci\u00F3n desactiva los diagn\u00F3sticos con datos confidenciales (si est\u00E1n activados) por el nombre de registrador proporcionado.

DiagnosticsEnableSensitiveDiagnosticsOperationDescription=Los diagn\u00F3sticos con datos confidenciales est\u00E1n desactivados por defecto. Esta operaci\u00F3n activa los diagn\u00F3sticos con datos confidenciales.

DiagnosticsDisableSensitiveDiagnosticsOperationDescription=Los diagn\u00F3sticos con datos confidenciales est\u00E1n desactivados por defecto. Esta operaci\u00F3n desactiva los diagn\u00F3sticos con datos confidenciales si est\u00E1n activados.

DiagnosticsUpdateDiagnosticLevelByConnectionIdPrefixOperationDescription=Actualice el nivel de diagn\u00F3stico por el prefijo del ID de conexi\u00F3n proporcionado. La cadena de argumento puede estar formada por un nombre de nivel o un valor entero. Por ejemplo: "SEVERE" o "1000".

DiagnosticsUpdateDiagnosticLevelByTenantNameOperationDescription=Actualice el nivel de diagn\u00F3stico por el nombre de inquilino proporcionado. La cadena de argumento puede estar formada por un nombre de nivel o un valor entero. Por ejemplo: "SEVERE" o "1000".

DiagnosticsUpdateDiagnosticLevelByLoggerNameOperationDescription=Actualice el nivel de diagn\u00F3stico por el nombre de registrador proporcionado. La cadena de argumento puede estar formada por un nombre de nivel o un valor entero. Por ejemplo: "SEVERE" o "1000".

DiagnosticsUpdateDiagnosticLevelOperationDescription=Actualice el nivel de diagn\u00F3stico. La cadena de argumento puede estar formada por un nombre de nivel o un valor entero. Por ejemplo: "SEVERE" o "1000".

DiagnosticsUpdateBufferSizeByConnectionIdPrefixOperationDescription=Actualice el tama\u00F1o del buffer de rastreo en memoria por el prefijo del ID de conexi\u00F3n proporcionado. El tama\u00F1o de buffer por defecto es de 4000 registros de log.

DiagnosticsUpdateBufferSizeByTenantNameOperationDescription=Actualice el tama\u00F1o del buffer de rastreo en memoria por el nombre de inquilino proporcionado. El tama\u00F1o de buffer por defecto es de 4000 registros de log.

DiagnosticsUpdateBufferSizeByLoggerNameOperationDescription=Actualice el tama\u00F1o del buffer de rastreo en memoria por el nombre de registrador proporcionado. El tama\u00F1o de buffer por defecto es de 4000 registros de log.

DiagnosticsUpdateBufferSizeOperationDescription=Actualice el tama\u00F1o del buffer de rastreo en memoria. El tama\u00F1o de buffer por defecto es de 4000 registros de log.

DiagnosticsReadLoggingConfigFileOperationDescription=Reinicie las propiedades de registro y vuelva a leer la configuraci\u00F3n de registro del archivo proporcionado, que debe estar en formato java.util.Properties.

DiagnosticsAddErrorCodeToWatchListOperationDescription=Agregue el c\u00F3digo de error que se debe comprobar en la siguiente ocurrencia con el formato ORA-XXXXX. El controlador JDBC escribe el rastreo en memoria en el manejador de log configurado cuando se produce un error en la lista de comprobaciones.

DiagnosticsRemoveErrorCodeFromWatchListOperationDescription=Elimine el c\u00F3digo de error proporcionado de la lista de comprobaciones. El c\u00F3digo de error debe tener el formato ORA-XXXXX.

DiagnosticsReturnErrorCodesWatchListOperationDescription=Obtener c\u00F3digos de error que se est\u00E1n comprobando.

DiagnosticsResetErrorCodesWatchListOperationDescription=Configure la lista de comprobaciones con los c\u00F3digos de error por defecto.

DiagnosticsDumpTraceOperationDescription=Vuelque el rastreo en memoria en el manejador de destino.

DiagnosticsDumpTraceWhenFutureExceptionContainsOperationDescription=Vuelque el rastreo cuando la excepci\u00F3n futura contenga una de las palabras clave proporcionadas. Las palabras clave de ejemplo se han restablecido, violaci\u00F3n.

DiagnosticsClearExceptionKeywordsOperationDescription=Borre las palabras clave agregadas anteriormente.

DiagnosticsEnableWriteLogsToTraceOperationDescription=Por defecto, los logs se escriben en el manejador de logs. Esta operaci\u00F3n puede activar o desactivar la escritura de los logs en el rastreo en memoria.

DiagnosticsConnectionIdPrefixParameterDescription=Prefijo del ID de conexi\u00F3n.

DiagnosticsTenantNameParameterDescription=Nombre de inquilino.

DiagnosticsLoggerNameParameterDescription=Nombre de registrador.

DiagnosticsLevelParameterDescription=Nivel de registrador.

DiagnosticsBufferSizeParameterDescription=Tama\u00F1o del buffer de rastreo en memoria.

DiagnosticsConfigFileParameterDescription=Archivo de configuraci\u00F3n de registro.

DiagnosticsErrorCodesParameterDescription=C\u00F3digo de error con formato ORA-XXXXX.

DiagnosticsEnabledParameterDescription=Valor True o False.

DiagnosticsCommaSeparatedKeywordsParameterDescription=Las palabras clave son valores separados por comas.

#     ^     ^     ^     ^
#     |     |     |     |        P L E A S E    R E A D
#
# Add new message above this comment.
# Before you add a new message, please read "Message Guideline" at the
# top of this file first.
#






